In [7]:
import pandas as pd
import numpy as np

In [8]:
# creacion de un array
arreglo = np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
# creacion de un dataframe
df =pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
# dar nombre a las columnas
df=pd.DataFrame(data=arreglo,index=['A','B','C'],columns=['D','E','F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [11]:
df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [12]:
# informacion del dataframe
df.info()
df.shape   # dimensiones del dataframe
df.describe()  # estadisticas del dataframe
df.columns  # nombre de las columnas
df.index  # nombre de los indices

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

Index(['A', 'B', 'C'], dtype='object')

In [13]:
df.loc['G'] =[11,12,13]  # agregar una fila
df['H']=[17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [14]:
#Extraer una columna del dataframe 
#Sintaxis: df['nombre_columna'] doble corchete

df2=df[['E','H']]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [15]:
df3=df.iloc[0:2]  # extraer filas
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [16]:
# cambio de nombre de las columnas
df.columns=['C1','C2','C3','C4']
df

   C1  C2  C3  C4
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [17]:
# cambio de alguna columna

df.rename(columns={'C1':'A','C2':'B'},inplace=True)
df

# se cambio el nombre de C1 a A y C2 a B

    A   B  C3  C4
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [18]:
# cambio de nombre de renglones o filas

df.rename(index={'A':'Dato1','B':'Dato2'},inplace=True)
df

        A   B  C3  C4
Dato1   1   2   3  17
Dato2   4   5   6  16
C       7   8   9  15
G      11  12  13  14

In [19]:
# Ordenar un dataframe ASC o DESC
df4=df.sort_values(by='C3',ascending=False)
df4

        A   B  C3  C4
G      11  12  13  14
C       7   8   9  15
Dato2   4   5   6  16
Dato1   1   2   3  17

In [20]:
df5=df.sort_values(by='C3',ascending=True)
df5

        A   B  C3  C4
Dato1   1   2   3  17
Dato2   4   5   6  16
C       7   8   9  15
G      11  12  13  14

In [21]:
# Verificacion de condiciones en un dataframe
df["B"]>5

Dato1    False
Dato2    False
C         True
G         True
Name: B, dtype: bool

In [22]:
# filtrar un dataframe
df[df["B"]>5]

    A   B  C3  C4
C   7   8   9  15
G  11  12  13  14

In [23]:
condicion1=df["B"]>5
condicion2=df["C3"]<12
df[condicion1 & condicion2]

   A  B  C3  C4
C  7  8   9  15

In [35]:
arreglo =np.array([['Bella','Labrador',3,50,'2019-08-20'],['Rex','Pastor Aleman',5,30,'2021-10-12'],['Rufus','Bulldog',7,20,'2018-04-02'],['Toto','Pinscher',12,20,'2015-12-20']])
arreglo

array([['Bella', 'Labrador', '3', '50', '2019-08-20'],
       ['Rex', 'Pastor Aleman', '5', '30', '2021-10-12'],
       ['Rufus', 'Bulldog', '7', '20', '2018-04-02'],
       ['Toto', 'Pinscher', '12', '20', '2015-12-20']], dtype='<U13')

In [36]:
df=pd.DataFrame(data=arreglo,columns=['Nombre','Raza','Edad','Altura_cm','Fecha_nac'])
df

  Nombre           Raza Edad Altura_cm   Fecha_nac
0  Bella       Labrador    3        50  2019-08-20
1    Rex  Pastor Aleman    5        30  2021-10-12
2  Rufus        Bulldog    7        20  2018-04-02
3   Toto       Pinscher   12        20  2015-12-20

In [33]:
#consulta de perros nacidos despues del 2020
df2=df[df['Fecha_nac']>'2020-01-01']
df2

  Nombre           Raza Edad   Fecha_nac
1    Rex  Pastor Aleman    5  2021-10-12

In [37]:
# cambiar el tipo de dato de una columna
# la altura es un dato numerico por lo que se cambia a entero
df['Altura_cm']=df['Altura_cm'].astype(int)

In [38]:
df[df['Altura_cm']>30]

  Nombre      Raza Edad  Altura_cm   Fecha_nac
0  Bella  Labrador    3         50  2019-08-20

In [39]:
df2=df[['Nombre','Raza']]
df2

  Nombre           Raza
0  Bella       Labrador
1    Rex  Pastor Aleman
2  Rufus        Bulldog
3   Toto       Pinscher